# Editor : Liquid
# Time :  15:00


'''
使用append在列表尾增加一个元素
使用extend在列表尾增加至少一个元素
使用insert在任意位置上添加一个元素
使用切片在任意位置上添加多个元素
'''

lst = [10, 20, 30, 40, 50, 60, 70, 80]
lst2 = lst[1:6:1]
lst.append(lst2)
print(lst)  # [10, 20, 30, 40, 50, 60, 70, 80, [20, 30, 40, 50, 60]] 将列表作为一个元素添加
lst.extend(lst2)
print(lst)  # [10, 20, 30, 40, 50, 60, 70, 80, [20, 30, 40, 50, 60], 20, 30, 40, 50, 60]  直接添加多个
lst.insert(1, 90)
print(lst)  # [10, 90, 20, 30, 40, 50, 60, 70, 80, [20, 30, 40, 50, 60], 20, 30, 40, 50, 60]
lst3 = ['hello', 'world', 100]
# lst[1:] = lst3
# print(lst)  # [10, 'hello', 'world', 100] 发生了覆盖
# lst[1:2:] = lst3
# print(lst)  # [10, 'hello', 'world', 100, 20, 30, 40, 50, 60, 70, 80, [20, 30, 40, 50, 60], 20, 30, 40, 50, 60]
lst[1:3:] = lst3
print(lst)  # [10, 'hello', 'world', 100, 30, 40, 50, 60, 70, 80, [20, 30, 40, 50, 60], 20, 30, 40, 50, 60] 覆盖了区间内的值
